Revit 2027 API
ElementId(BuiltInCategory) Constructor
 Create an ElementId handle with the given BuiltInCategory id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId(
	BuiltInCategory categoryId
)
Public Sub New (
	categoryId As BuiltInCategory
)
public:
ElementId(
	BuiltInCategory categoryId
)
new :
        categoryId : BuiltInCategory -> ElementId
Parameters
categoryId BuiltInCategory
The id.
See Also
Reference
ElementId Class
ElementId Overload
Autodesk.Revit.DB Namespace